using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Managment
{
    class Development
    {
        /// FManager---------------------------------------------------------------------------------------
        /// Формирование программы 16h
        /// Доработка над модулями:
        ///     Работа над обновление LatestHe - 7h
        ///     Обработка с добавлением возможности сохранения ошибки при запуске драйвера - 1.5h
        ///     Работа над переносом обновления под Git - 7h
        ///     
        ///  Разработка version 2.0: 
        ///     Работа над модулем считывания и записи данных из файла в БД: 12h
        ///     Проектирование интерфейса и часть первичной логики: 1h
        ///     Реализация интерфейса: 6h
        ///     Реализация первичной логики и доработка по интерфейсу: 8h
        ///     Реализация модуля аналитики: 12h
        ///     Реализация модуля администратора: 7h
        ///     Реализация модуля обновления: 12.5h
        ///     Реализация аналитики по таблицам He: 12h
        ///     Реализация модуля дополнительных возможностей: 2h
        ///     Реализоция перехода на SQLite: 3h
        ///  Разработка version 2.1:
        ///     Поддержка модов HeCar: 4h
        ///     Поддержка диаграмм: 4.5h
        ///  Разработка version 2.2:
        ///     Измен размер главной формы: 0.5h
        ///     Исправлены баги по подсчету копеек, модулю HeCar, кодировкам: 1.5h
        /// 

        /// Starter------------------------------------------------------------------------------------------
        /// Проектировка дизайна 2h
        /// Реализация лаунчеров 9.5h
        /// Поддержка модов HeCar: 0.5h
        ///  
        /// 
        ///--------------------------------------------------------------------------------------------------
    }
}
