using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Managment
{
    public class Issues
    {
        //Разобраться с обновлением файла

        ///------
        ///FManager
        /// Подумать о том, какие еще настройки можно вынести в стартер.
        /// -При смене мода сохранять месяц запроса
        /// -Добавить поддержку режима AllHe.
        ///------

        ///------
        ///FManager
        ///Starter
        ///-Переименовать backup на кнопке
        ///------

        ///--------------------------------------------------------------------------------------------------
        ///     Версия 3.0
        ///     Аналитика одежды.
        ///         /// CManager-----------------------------------------------------------------------------------------
        /// 
        ///--------------------------------------------------------------------------------------------------
        ///-------------------------------------------------------------------------------------------------
    }
}
